Documents/ВводНачальныхОстатков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ВводНачальныхОстатков</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыСПоставщиками</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоЛьготам</xr:Item>
				<xr:Item>AccumulationRegister.ВзаиморасчетыПоСубсидиям</xr:Item>
				<xr:Item>AccumulationRegister.ЗапасыНаСкладах</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ЛицевыеСчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Здание</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЛицевойСчет</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Запасы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Склад</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыСКонтрагентами</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидВзаиморасчетов</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыПоСубсидиям</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВзаиморасчетыПоЛьготам</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоговорКонтрагента</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДенежныеСредства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>БанковскийСчетКасса</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
								<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВводНачальныхОстатков/Forms/ФормаДокумента/Ext/Form/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ДЛЯ УПРАВЛЕНИЯ ВНЕШНИМ ВИДОМ ФОРМЫ

&НаКлиенте
// Функция получает имя страницы для раздела учета документа.
//
// Параметры:
//	РазделУчета - ПеречислениеСсылка.РазделыУчета - Раздел учета
//
// Возвращаемое значение:
//	Строка - Имя страницы, соответствующая разделй учета
//
Функция ПолучитьИмяСтраницы(РазделУчета)

	Соответствие = Новый Соответствие;
	Соответствие.Вставить("Лицевые счета", "ГруппаЛицевыеСчета");
	Соответствие.Вставить("Запасы", "ГруппаЗапасы");
	Соответствие.Вставить("Взаиморасчеты с контрагентами", "ГруппаВзаиморасчетыСКонтрагентами");
	Соответствие.Вставить("Взаиморасчеты по субсидиям", "ГруппаВзаиморасчетыПоСубсидиям");
	Соответствие.Вставить("Взаиморасчеты по льготам", "ГруппаВзаиморасчетыПоЛьготам");
	Соответствие.Вставить("Денежные средства", "ГруппаДенежныеСредства");
	
	ИмяСтраницы = Соответствие.Получить(РазделУчета);
	
	Возврат ИмяСтраницы;

КонецФункции // ПолучитьИмяСтраницы()

&НаКлиенте
// Процедура устанавливает текущую страницу в зависимости от раздела учета.
//
Процедура УставитьТекущуюСтраницу()
	
	Элемент = Элементы.Найти(ПолучитьИмяСтраницы(Объект.РазделУчета));
	
	Если Элемент <> Неопределено Тогда
		ЭтаФорма.Элементы.Страницы.ТекущаяСтраница = Элемент;
	КонецЕсли;
	
КонецПроцедуры // УставитьТекущуюСтраницу()

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ФОРМЫ

// Процедура - обработчик события ПриСозданииНаСервере.
//
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОСМДСервер.ЗаполнитьШапкуДокумента(
		Объект,
		,
		Параметры.ЗначениеКопирования,
		Параметры.Основание,
		СостояниеДокумента,
		КартинкаСостоянияДокумента,
		РазрешеноПроведение,
		ПоследнееИзменение,
		Параметры.ЗначенияЗаполнения);
	
	// ДополнительныеОтчетыИОбработки
	ДополнительныеОтчетыИОбработки.ПриСозданииНаСервере(ЭтаФорма);
	// Конец ДополнительныеОтчетыИОбработки
	
	Локализация.ПриСозданииНаСервере(ЭтаФорма, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
// Процедура - обработчик события ПриОткрытии.
//
Процедура ПриОткрытии(Отказ)

	УставитьТекущуюСтраницу();
	
КонецПроцедуры // ПриОткрытии()


// Процедура - обработчик события ПослеЗаписи.
//
&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ОСМДКлиент.ОбновитьСостояниеДокумента(Объект, СостояниеДокумента, КартинкаСостоянияДокумента, РазрешеноПроведение, ПоследнееИзменение);
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Процедура - обработчик события ПриИзменении поля ввода РазделУчета.
//
&НаКлиенте
Процедура РазделУчетаПриИзменении(Элемент)
	
	// Установка текущей страницы формы.
	УставитьТекущуюСтраницу();
	
	Объект.ЛицевыеСчета.Очистить();
	Объект.Запасы.Очистить();
	Объект.ВзаиморасчетыСКонтрагентами.Очистить();
	Объект.ВзаиморасчетыПоЛьготам.Очистить();
	Объект.ВзаиморасчетыПоСубсидиям.Очистить();
	
КонецПроцедуры

// Процедура - обработчик команды Подбор.
//
&НаКлиенте
Процедура Подбор(Команда)
	
	Если НЕ ЗначениеЗаполнено(Объект.Организация) Тогда
		ТекстСообщения = НСтр("ru='Не заполнены реквизиты Организация.';uk='Не заповнені реквізити Організація.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;
		
	ПараметрыЗаполнения = Новый Структура;
	
	ПараметрыЗаполнения.Вставить("ДатаНачала",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ДатаОкончания",	Объект.Дата);
	ПараметрыЗаполнения.Вставить("ОтборОрганизация",	Объект.Организация);
	
	АдресЛицевыхСчетовВХранилище = ОткрытьФормуМодально("ОбщаяФорма.ФормаПодбораЛицевыхСчетов", ПараметрыЗаполнения);
	
	Если ЗначениеЗаполнено(АдресЛицевыхСчетовВХранилище) Тогда
		ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище);
	КонецЕсли;
	
	
КонецПроцедуры

// Функция получает список лицевых счетов из временного хранилища
//
&НаСервере
Процедура ПолучитьЛицевыеСчетаИзХранилища(АдресЛицевыхСчетовВХранилище)
	
	ТаблицаДляЗагрузки	= ПолучитьИзВременногоХранилища(АдресЛицевыхСчетовВХранилище);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	НазначенныеУслугиСрезПоследних.ЛицевойСчет КАК ЛицевойСчет,
	|	НазначенныеУслугиСрезПоследних.Услуга,
	|	НазначенныеУслугиСрезПоследних.ЛицевойСчет.Владелец КАК Здание,
	|	НАЧАЛОПЕРИОДА(&Период, МЕСЯЦ) КАК МесяцНачисления
	|ИЗ
	|	РегистрСведений.НазначенныеУслуги.СрезПоследних(
	|			,
	|			Действует
	|				И ЛицевойСчет В (&СписокЛицевыхСчетов)) КАК НазначенныеУслугиСрезПоследних
	|
	|УПОРЯДОЧИТЬ ПО
	|	Здание,
	|	ЛицевойСчет,
	|	НазначенныеУслугиСрезПоследних.Услуга.Код";
	
	Запрос.УстановитьПараметр("Период", Объект.Дата);
	Запрос.УстановитьПараметр("СписокЛицевыхСчетов", ТаблицаДляЗагрузки.ВыгрузитьКолонку("ЛицевойСчет"));
	
	ТаблицаУслугЛичевыхСчетов = Запрос.Выполнить().Выгрузить();
	
	Для Каждого СтрокаТаблицаУслугЛичевыхСчетов Из ТаблицаУслугЛичевыхСчетов Цикл
		СтруктураОтбора = Новый Структура;
		СтруктураОтбора.Вставить("ЛицевойСчет",	СтрокаТаблицаУслугЛичевыхСчетов.ЛицевойСчет);
		СтруктураОтбора.Вставить("Услуга",	СтрокаТаблицаУслугЛичевыхСчетов.Услуга);
		СтруктураОтбора.Вставить("МесяцНачисления",	СтрокаТаблицаУслугЛичевыхСчетов.МесяцНачисления);
		
		Строки = Объект.ЛицевыеСчета.НайтиСтроки(СтруктураОтбора);
		Если Строки.Количество() > 0 Тогда
			ЗаполнитьЗначенияСвойств(Строки[0], СтрокаТаблицаУслугЛичевыхСчетов);
		Иначе
			НоваяСтрока = Объект.ЛицевыеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТаблицаУслугЛичевыхСчетов);
		КонецЕсли;
			
	КонецЦикла;
	
КонецПроцедуры // ПолучитьЛицевыеСчетаИзХранилища()
